snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <comment>Заказ на эмиссию кодов маркировки СУЗ</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовИзЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыЧЗВДокументе</name>
    <type>
      <types>EnumRef.ВидыНоменклатурыЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВводаВОборот</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗапланирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКомплекта</name>
    <type>
      <types>EnumRef.ВидыКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоКодовКомплект</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплект</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклатурыЧЗ/ВидыНоменклатурыЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатурыЧЗ</name>
  <enumValues>
    <name>Единица</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура УправлениеВидимостью()
	Имена = СтрРазделить("Организация,ДокументОснование,СпособВводаВОборот,Товары", ",");	
	
	мТолькоПросмотр = ТолькоПросмотр ИЛИ (Объект.Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе);
	Для Каждого ИмяЭУ Из Имена Цикл
		Элементы[ИмяЭУ].ТолькоПросмотр = мТолькоПросмотр;	
	КонецЦикла;
	
	Элементы.Статус.ТолькоПросмотр = ?(РольДоступна("Администратор"), ТолькоПросмотр, мТолькоПросмотр);
	//++Данилова Е.В. 03.04.2025 ASU-2175 
	Элементы.ТоварыКоличествоКомплект.Видимость = Объект.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект 
	ИЛИ Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.КомплектСпайка_Импорт(Объект.Ссылка)  
	//--Данилова Е.В. 03.04.2025  
	//++Данилова Е.В. 29.05.2026 
	ИЛИ Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.КомплектСпайка_ПоПеремаркировке(Объект.Ссылка); 
	//--Данилова Е.В. 29.05.2026 
КонецПроцедуры
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборКМ();	
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборКМ()
	МаркировкаКС.УстановитьПараметрДинамическогоСписка(СписокКМ, "ЗаказКМ", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтборКМ();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)	
	Если ИмяСобытия = "ИзмененСтатус" И Источник = Объект.Ссылка  Тогда
		Если НЕ Модифицированность Тогда		
			Прочитать();
			УправлениеВидимостью();
		КонецЕсли;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ГТИН = СокрЛП(Текст);
	Если СтрДлина(ГТИН) = 14 И Лев(ГТИН, 1) = "0" Тогда
		//ДанныеВыбора = Справочники.Номенклатура.НайтиПоРеквизиту("ГТИН", ГТИН);	
		//СтандартнаяОбработка = Ложь;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Товары.Количество() > 10 Тогда
		ПоказатьПредупреждение(,"Превышено максимальное количество строк ! Допускается не более 10 позиций !");
		Отказ = Истина;
	КонецЕсли;
	//++Данилова Е.В. 24.01.2025
	Если НЕ Отказ
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовМаркировки.ВРаботе")
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		СоздаватьДокументПоГотовымКомплектам = Ложь; 
		ПроверитьДокументНаНаличиеГотовыхКомплектовНаСервере(СоздаватьДокументПоГотовымКомплектам);
		
		Если СоздаватьДокументПоГотовымКомплектам Тогда
			
			Отказ = Истина; 
			
			ОповещениеВопросПоСозданиюДокумента = Новый ОписаниеОповещения("ОтветаНаВопросСоздатьДокументГотовыйКомплект",ЭтаФорма); 
			ПоказатьВопрос(ОповещениеВопросПоСозданиюДокумента,"Найдены готовые комплекты, выделить их в отдельный документ?",РежимДиалогаВопрос.ОКОтмена); 	
		
		КонецЕсли;
	
	КонецЕсли;
	//--Данилова Е.В. 24.01.2025  
	//Валетов + 21,04,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3669
	ОшибкаИНН = ПроверитьИмпортПередЗаписью(); 
	Если ОшибкаИНН Тогда
		СообщитьИзМодуля("Запрещено создание импортных заказов КМ по организации ЕЕЭ!");
		Отказ = ОшибкаИНН;
	 КонецЕсли;
	 
КонецПроцедуры 

&НаСервере
Функция  ПроверитьИмпортПередЗаписью()    
	//рШапки = ПолучитьРеквизитыШапки(Объект.Ссылка, "Организация.ИНН", "Документ");
	Если Объект.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт 
		И СокрЛП(Объект.Организация_ИНН) = "7717115270" Тогда //Запрет создания заказа Импортных кодов от ЕЕЭ	
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	           
КонецФункции 
//Валетов -

&НаКлиенте
Процедура СпособВводаВОборот_ПриИзменении(Элемент)
	Если Объект.СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт Тогда	
		Объект.Организация = Неопределено;
	КонецЕсли;
КонецПроцедуры

//++Данилова Е.В. 24.01.2025

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПроверитьДокументНаНаличиеГотовыхКомплектовНаСервере(СоздаватьДокументПоГотовымКомплектам)

	ОбъектДок = РеквизитФормыВЗначение("Объект"); 
	СтруктураДанныхПоТоварам = ОбъектДок.ПроверитьГотовыеКомплектыВДокументе(Объект.Товары.Выгрузить()); 
	Если СтруктураДанныхПоТоварам.ГотовыеКомплекты  
		И СтруктураДанныхПоТоварам.НеГотовыеКомплекты Тогда   		
		 
		СоздаватьДокументПоГотовымКомплектам = Истина; 
		
	ИначеЕсли СтруктураДанныхПоТоварам.ГотовыеКомплекты  
		И НЕ СтруктураДанныхПоТоварам.НеГотовыеКомплекты Тогда 
		
		Объект.ВидНоменклатурыЧЗВДокументе = Перечисления.ВидыНоменклатурыЧЗ.Набор; 
		//++Данилова Е.В. 26.03.2025
		Объект.ВидКомплекта = Перечисления.ВидыКомплектов.ГотовыйКомплект; 
		//--Данилова Е.В. 26.03.2025
	КонецЕсли;
КонецПроцедуры // ПроверитьДокументНаНаличиеГотовыхКомплектовНаСервере()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОтветаНаВопросСоздатьДокументГотовыйКомплект(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 

	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
		
		
		ДокументПоКомплектам = СоздатьДокументГотовыйКомплектНаСервере();
		 
		
		Записать();
		
		ОткрытьЗначение(ДокументПоКомплектам); 
		
		//ФормаЗаказа.Открыть(); 
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьДокументГотовыйКомплектНаСервере()
	
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	
	НовыйДокумент = ОбъектДок.СоздатьНовыйДокументПоГотовымКомплектам(ОбъектДок,Объект.Товары.Выгрузить());
	//удалиить строки из существующего 
	
	Для каждого СтрокаТоваров Из  НовыйДокумент.Товары Цикл
	
		  НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура)); 
	      Если  НайденныеСтроки.Количество()> 0 Тогда
		  
		  	   Объект.Товары.Удалить(НайденныеСтроки[0]); 
		  
		  КонецЕсли;
	  КонецЦикла;
	  
	  Возврат НовыйДокумент.ссылка; 
	 	
КонецФункции

//++наряд MARK-1326
&НаКлиенте
Процедура ЗагрузитьНоменклатуруИзФайла(Команда)
	
	Если ЗначениеЗаполнено(Объект.Статус) 
		И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыДокументовМаркировки.ВРаботе") Тогда
		
		ПоказатьПредупреждение(,"Добавление возможно только в статусе ""В работе"""); 
		
		Возврат; 
	
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 0  Тогда
		
		ОповещениеВопрос = Новый ОписаниеОповещения("ПослеОтветаОчиститьТовары",ЭтаФорма); 
		ПоказатьВопрос(ОповещениеВопрос,"Очистить таблицу товаров?",РежимДиалогаВопрос.ДаНетОтмена); 
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура(); 
		
		ДиалогПомещения = Новый ПараметрыДиалогаПомещенияФайлов;
		ДиалогПомещения.МножественныйВыбор = Истина;
		
		ОповещениеЗавершения = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение",ЭтотОбъект,ДополнительныеПараметры);  
		
		НачатьПомещениеФайловНаСервер(ОповещениеЗавершения,,,,Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПослеОтветаОчиститьТовары(ОтветНаВопрос,ДопПараметры) Экспорт
	 
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		
		Объект.Товары.Очистить();
	ИначеЕсли  ОтветНаВопрос = КодВозвратаДиалога.Отмена 
		ИЛИ ОтветНаВопрос = Неопределено Тогда 
		
		Возврат; 
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура(); 
	
	ДиалогПомещения = Новый ПараметрыДиалогаПомещенияФайлов;
	ДиалогПомещения.МножественныйВыбор = Истина;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение",ЭтотОбъект,ДополнительныеПараметры);  
	
	НачатьПомещениеФайловНаСервер(ОповещениеЗавершения,,,,Новый УникальныйИдентификатор);

КонецПроцедуры // ПослеОтветаОчиститьТовары()

 &НаКлиенте
Процедура ЗагрузитьФайлЗавершение(ОписаниеФайлов,ДополнительныеПараметры) Экспорт
	
	Если ОписаниеФайлов = неопределено  Тогда
		
		Возврат; 
		
	КонецЕсли;   
	
	Для каждого Файл Из ОписаниеФайлов Цикл
		ЗагрузитьФайлЗавершениеНаСервере(Файл.Адрес,ДополнительныеПараметры);  	
	КонецЦикла;	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлЗавершениеНаСервере(АдресФайла,ДополнительныеПараметры)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяВремФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные.Записать(ИмяВремФайла);
	
	ТабличныйДокумент = новый ТабличныйДокумент();
	ТабличныйДокумент.Прочитать(ИмяВремФайла,СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область());
	ПостроительЗапроса.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат = неопределено Тогда
		
		Сообщить("Не получилось отработать построитель"); 
		
		Возврат; 
		
	КонецЕсли;
	
	ТаблицаЗначенийИзФайла = ПостроительЗапроса.Результат.Выгрузить();
		    	
	//первая колонка  - или код, или наименование, или штрихкод, вторая колонка - количество 
	НомерСтроки = 1; 
	Для каждого СтрокаТЧ  Из ТаблицаЗначенийИзФайла  Цикл
		НомерСтроки = НомерСтроки + 1; 
		Номенклатура = НайтиНоменклатуруПоЗначениюВКолонке(СтрокаТЧ[0]); 
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			
			Сообщить("По номеру строки №" + Строка(НомерСтроки) + " не найдена номенклатура" ); 	
			
		КонецЕсли;
		Попытка
			
			Количество = Число(СтрокаТЧ[1]); 
			
		Исключение
			Количество = СтрокаТЧ[1]; 
		КонецПопытки;
		
		
		НоваяСтрока = Объект.Товары.Добавить(); 
		НоваяСтрока.Номенклатура = Номенклатура; 
		НоваяСтрока.Количество = Количество; 
		
	КонецЦикла;	
	
	 
		
		
КонецПроцедуры

&НаСервере
Функция НайтиНоменклатуруПоЗначениюВКолонке(Знач ЗначениеДляПоиска)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.Код = &ЗначениеДляПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.Наименование ПОДОБНО &ЗначениеДляПоиска
		|	И НЕ Номенклатура.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ШтрихКоды.Владелец = Номенклатура.Ссылка
		|ГДЕ
		|	НЕ ШтрихКоды.ПометкаУдаления
		|	И ШтрихКоды.Наименование ПОДОБНО &ЗначениеДляПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ГТИН ПОДОБНО &ЗначениеДляПоиска
		|	И НЕ Номенклатура.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ЗначениеДляПоиска", Строка(ЗначениеДляПоиска));
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	Если ПакетРезультатов[0].Пустой() Тогда
		
		Если ПакетРезультатов[1].Пустой() Тогда
			
			Если ПакетРезультатов[2].Пустой() Тогда
				
				Если ПакетРезультатов[3].Пустой() Тогда
					
					Возврат Справочники.Номенклатура.ПустаяСсылка();
					
				Иначе 
					Выборка =  ПакетРезультатов[3].Выбрать();
				КонецЕсли;
				
				
				
			Иначе 
				Выборка =  ПакетРезультатов[2].Выбрать(); 
			КонецЕсли;
			
		Иначе 
			
			Выборка =  ПакетРезультатов[1].Выбрать();
			
		КонецЕсли;
		
		
	Иначе 
		
		Выборка =  ПакетРезультатов[0].Выбрать(); 
		
	КонецЕсли;
	
	Выборка.Следующий(); 
	Возврат Выборка.Ссылка;

КонецФункции // НайтиНоменклатуруПоЗначениюВКолонке()
//--наряд MARK-1326


//--Данилова Е.В. 24.01.2025
